In [78]:
import pandas as pd

In [79]:
a=pd.Series(["Asmit","Sita","Gita","Hari"])
b=pd.Series([1000,1400,4000,5000])

In [80]:
df=pd.DataFrame({"Name":a,"Salary":b})
df

    Name  Salary
0  Asmit    1000
1   Sita    1400
2   Gita    4000
3   Hari    5000

In [20]:
df[["Name"]][0:3]

    Name
0  Asmit
1   Sita
2   Gita

In [26]:
df.loc[1:2,"Name":"Salary"]

   Name  Salary
1  Sita    1400
2  Gita    4000

In [27]:
df.loc[1,"Name"]

'Sita'

In [29]:
df.iloc[1:3,0]

1    Sita
2    Gita
Name: Name, dtype: object

In [31]:
df.iloc[2:4]

   Name  Salary
2  Gita    4000
3  Hari    5000

In [32]:
df.iloc[2:4,0:1]

   Name
2  Gita
3  Hari

In [38]:
df.iloc[2,1]

4000

Subsetting

In [39]:
df

    Name  Salary
0  Asmit    1000
1   Sita    1400
2   Gita    4000
3   Hari    5000

In [41]:
df["Salary"]>=1000

0    True
1    True
2    True
3    True
Name: Salary, dtype: bool

In [42]:
df[df["Salary"]>1000]

   Name  Salary
1  Sita    1400
2  Gita    4000
3  Hari    5000

#Setting

In [54]:
df

    Name  Salary
0  Asmit    1000
1   Sita    1400
2   Gita    4000
3   Hari    5000

In [55]:
df["Salary"]=[2000,8000,3000,2323]

In [56]:
df

    Name  Salary
0  Asmit    2000
1   Sita    8000
2   Gita    3000
3   Hari    2323

In [81]:
df

    Name  Salary
0  Asmit    1000
1   Sita    1400
2   Gita    4000
3   Hari    5000